IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/MSP432/LCD_F_356.0.xml
<module id="LCD_F" HW_revision="356.0">
    <register id="LCDCTL" width="32" offset="0x0" internal="0" description="LCD_F control">
        <bitfield id="LCDON" description="LCD on" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="LCDON_0" value="0x0" description="LCD module off"/>
            <bitenum id="LCDON_1" value="0x1" description="LCD module on"/>
        </bitfield>
        <bitfield id="LCDLP" description="LCD Low-power Waveform" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="LCDLP_0" value="0x0" description="Standard LCD waveforms on segment and common lines selected"/>
            <bitenum id="LCDLP_1" value="0x1" description="Low-power LCD waveforms on segment and common lines selected"/>
        </bitfield>
        <bitfield id="LCDSON" description="LCD segments on" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="LCDSON_0" value="0x0" description="All LCD segments are off"/>
            <bitenum id="LCDSON_1" value="0x1" description="All LCD segments are enabled and on or off according to their corresponding memory location"/>
        </bitfield>
        <bitfield id="LCDMX" description="LCD mux rate" begin="5" end="3" width="3" rwaccess="R/W">
            <bitenum id="LCDMX_0" value="0x0" description="Static"/>
            <bitenum id="LCDMX_1" value="0x1" description="2-mux"/>
            <bitenum id="LCDMX_2" value="0x2" description="3-mux"/>
            <bitenum id="LCDMX_3" value="0x3" description="4-mux"/>
            <bitenum id="LCDMX_4" value="0x4" description="5-mux"/>
            <bitenum id="LCDMX_5" value="0x5" description="6-mux"/>
            <bitenum id="LCDMX_6" value="0x6" description="7-mux"/>
            <bitenum id="LCDMX_7" value="0x7" description="8-mux"/>
        </bitfield>
        <bitfield id="LCDPRE" description="LCD frequency pre-scaler" begin="10" end="8" width="3" rwaccess="R/W">
            <bitenum id="LCDPRE_0" value="0x0" description="Divide by 1"/>
            <bitenum id="LCDPRE_1" value="0x1" description="Divide by 2"/>
            <bitenum id="LCDPRE_2" value="0x2" description="Divide by 4"/>
            <bitenum id="LCDPRE_3" value="0x3" description="Divide by 8"/>
            <bitenum id="LCDPRE_4" value="0x4" description="Divide by 16"/>
            <bitenum id="LCDPRE_5" value="0x5" description="Divide by 32"/>
            <bitenum id="LCDPRE_6" value="0x6" description="Reserved (defaults to divide by 32)"/>
            <bitenum id="LCDPRE_7" value="0x7" description="Reserved (defaults to divide by 32)"/>
        </bitfield>
        <bitfield id="LCDDIV" description="LCD frequency divider" begin="15" end="11" width="5" rwaccess="R/W">
            <bitenum id="LCDDIV_0" value="0x0" description="Divide by 1"/>
            <bitenum id="LCDDIV_1" value="0x1" description="Divide by 2"/>
            <bitenum id="LCDDIV_2" value="0x2" description="Divide by 3"/>
            <bitenum id="LCDDIV_3" value="0x3" description="Divide by 4"/>
            <bitenum id="LCDDIV_4" value="0x4" description="Divide by 5"/>
            <bitenum id="LCDDIV_5" value="0x5" description="Divide by 6"/>
            <bitenum id="LCDDIV_6" value="0x6" description="Divide by 7"/>
            <bitenum id="LCDDIV_7" value="0x7" description="Divide by 8"/>
            <bitenum id="LCDDIV_8" value="0x8" description="Divide by 9"/>
            <bitenum id="LCDDIV_9" value="0x9" description="Divide by 10"/>
            <bitenum id="LCDDIV_10" value="0xA" description="Divide by 11"/>
            <bitenum id="LCDDIV_11" value="0xB" description="Divide by 12"/>
            <bitenum id="LCDDIV_12" value="0xC" description="Divide by 13"/>
            <bitenum id="LCDDIV_13" value="0xD" description="Divide by 14"/>
            <bitenum id="LCDDIV_14" value="0xE" description="Divide by 15"/>
            <bitenum id="LCDDIV_15" value="0xF" description="Divide by 16"/>
            <bitenum id="LCDDIV_16" value="0x10" description="Divide by 17"/>
            <bitenum id="LCDDIV_17" value="0x11" description="Divide by 18"/>
            <bitenum id="LCDDIV_18" value="0x12" description="Divide by 19"/>
            <bitenum id="LCDDIV_19" value="0x13" description="Divide by 20"/>
            <bitenum id="LCDDIV_20" value="0x14" description="Divide by 21"/>
            <bitenum id="LCDDIV_21" value="0x15" description="Divide by 22"/>
            <bitenum id="LCDDIV_22" value="0x16" description="Divide by 23"/>
            <bitenum id="LCDDIV_23" value="0x17" description="Divide by 24"/>
            <bitenum id="LCDDIV_24" value="0x18" description="Divide by 25"/>
            <bitenum id="LCDDIV_25" value="0x19" description="Divide by 26"/>
            <bitenum id="LCDDIV_26" value="0x1A" description="Divide by 27"/>
            <bitenum id="LCDDIV_27" value="0x1B" description="Divide by 28"/>
            <bitenum id="LCDDIV_28" value="0x1C" description="Divide by 29"/>
            <bitenum id="LCDDIV_29" value="0x1D" description="Divide by 30"/>
            <bitenum id="LCDDIV_30" value="0x1E" description="Divide by 31"/>
            <bitenum id="LCDDIV_31" value="0x1F" description="Divide by 32"/>
        </bitfield>
        <bitfield id="LCDSSEL" description="Clock source select" begin="17" end="16" width="2" rwaccess="R/W">
            <bitenum id="LCDSSEL_0" value="0x0" description="ACLK"/>
            <bitenum id="LCDSSEL_1" value="0x1" description="VLOCLK"/>
            <bitenum id="LCDSSEL_2" value="0x2" description="REFOCLK"/>
            <bitenum id="LCDSSEL_3" value="0x3" description="LFXTCLK"/>
        </bitfield>
    </register>
    <register id="LCDBMCTL" width="32" offset="0x4" internal="0" description="LCD_F blinking and memory control">
        <bitfield id="LCDBLKMOD" description="Blinking mode" begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="LCDBLKMOD_0" value="0x0" description="Blinking disabled"/>
            <bitenum id="LCDBLKMOD_1" value="0x1" description="Blinking of individual segments as enabled in blinking memory register LCDBMx."/>
            <bitenum id="LCDBLKMOD_2" value="0x2" description="Blinking of all segments"/>
            <bitenum id="LCDBLKMOD_3" value="0x3" description="Switching between display contents as stored in LCDMx and LCDBMx memory registers."/>
        </bitfield>
        <bitfield id="LCDBLKPRE" description="Clock pre-scaler for blinking frequency" begin="4" end="2" width="3" rwaccess="R/W">
            <bitenum id="LCDBLKPRE_0" value="0x0" description="Divide by 512"/>
            <bitenum id="LCDBLKPRE_1" value="0x1" description="Divide by 1024"/>
            <bitenum id="LCDBLKPRE_2" value="0x2" description="Divide by 2048"/>
            <bitenum id="LCDBLKPRE_3" value="0x3" description="Divide by 4096"/>
            <bitenum id="LCDBLKPRE_4" value="0x4" description="Divide by 8162"/>
            <bitenum id="LCDBLKPRE_5" value="0x5" description="Divide by 16384"/>
            <bitenum id="LCDBLKPRE_6" value="0x6" description="Divide by 32768"/>
            <bitenum id="LCDBLKPRE_7" value="0x7" description="Divide by 65536"/>
        </bitfield>
        <bitfield id="LCDBLKDIV" description="Clock divider for blinking frequency" begin="7" end="5" width="3" rwaccess="R/W">
            <bitenum id="LCDBLKDIV_0" value="0x0" description="Divide by 1"/>
            <bitenum id="LCDBLKDIV_1" value="0x1" description="Divide by 2"/>
            <bitenum id="LCDBLKDIV_2" value="0x2" description="Divide by 3"/>
            <bitenum id="LCDBLKDIV_3" value="0x3" description="Divide by 4"/>
            <bitenum id="LCDBLKDIV_4" value="0x4" description="Divide by 5"/>
            <bitenum id="LCDBLKDIV_5" value="0x5" description="Divide by 6"/>
            <bitenum id="LCDBLKDIV_6" value="0x6" description="Divide by 7"/>
            <bitenum id="LCDBLKDIV_7" value="0x7" description="Divide by 8"/>
        </bitfield>
        <bitfield id="LCDDISP" description="Select LCD memory registers for display" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="LCDDISP_0" value="0x0" description="Display content of LCD memory registers LCDMx"/>
            <bitenum id="LCDDISP_1" value="0x1" description="Display content of LCD blinking memory registers LCDBMx"/>
        </bitfield>
        <bitfield id="LCDCLRM" description="Clear LCD memory" begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="LCDCLRM_0" value="0x0" description="Contents of LCD memory registers LCDMx remain unchanged"/>
            <bitenum id="LCDCLRM_1" value="0x1" description="Clear content of all LCD memory registers LCDMx"/>
        </bitfield>
        <bitfield id="LCDCLRBM" description="Clear LCD blinking memory" begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="LCDCLRBM_0" value="0x0" description="Contents of blinking memory registers LCDBMx remain unchanged"/>
            <bitenum id="LCDCLRBM_1" value="0x1" description="Clear content of all blinking memory registers LCDBMx"/>
        </bitfield>
    </register>
    <register id="LCDVCTL" width="32" offset="0x8" internal="0" description="LCD_F voltage control">
        <bitfield id="LCD2B" description="Bias select." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="LCD2B_0" value="0x0" description="1/3 bias"/>
            <bitenum id="LCD2B_1" value="0x1" description="For 5-mux to 8-mux modes:1/2 bias. For 5-mux to 8-mux modes - 1/4 bias."/>
        </bitfield>
        <bitfield id="LCDEXTBIAS" description="V2 to V4 voltage select" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="LCDEXTBIAS_0" value="0x0" description="V2 to V4 are generated internally"/>
            <bitenum id="LCDEXTBIAS_1" value="0x1" description="V2 to V4 are sourced externally and the internal bias generator is switched off"/>
        </bitfield>
        <bitfield id="R03EXT" description="V5 voltage select" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="R03EXT_0" value="0x0" description="V5 is VSS"/>
            <bitenum id="R03EXT_1" value="0x1" description="V5 is sourced from the R03 pin"/>
        </bitfield>
        <bitfield id="LCDREXT" description="V2 to V4 voltage on external Rx3 pins" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="LCDREXT_0" value="0x0" description="Internally generated V2 to V4 are not switched to pins (LCDEXTBIAS = 0)"/>
            <bitenum id="LCDREXT_1" value="0x1" description="Internally generated V2 to V4 are switched to pins (LCDEXTBIAS = 0)"/>
        </bitfield>
    </register>
    <register id="LCDPCTL0" width="32" offset="0xC" internal="0" description="LCD_F port control 0">
        <bitfield id="LCDS0" description="LCD pin 0 enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="LCDS0_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS0_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS1" description="LCD pin 1 enable" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="LCDS1_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS1_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS2" description="LCD pin 2 enable" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="LCDS2_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS2_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS3" description="LCD pin 3 enable" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="LCDS3_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS3_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS4" description="LCD pin 4 enable" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="LCDS4_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS4_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS5" description="LCD pin 5 enable" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="LCDS5_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS5_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS6" description="LCD pin 6 enable" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="LCDS6_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS6_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS7" description="LCD pin 7 enable" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="LCDS7_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS7_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS8" description="LCD pin 8 enable" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="LCDS8_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS8_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS9" description="LCD pin 9 enable" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="LCDS9_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS9_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS10" description="LCD pin 10 enable" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="LCDS10_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS10_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS11" description="LCD pin 11 enable" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="LCDS11_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS11_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS12" description="LCD pin 12 enable" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="LCDS12_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS12_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS13" description="LCD pin 13 enable" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="LCDS13_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS13_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS14" description="LCD pin 14 enable" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="LCDS14_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS14_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS15" description="LCD pin 15 enable" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="LCDS15_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS15_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS16" description="LCD pin 16 enable" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="LCDS16_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS16_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS17" description="LCD pin 17 enable" begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="LCDS17_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS17_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS18" description="LCD pin 18 enable" begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="LCDS18_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS18_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS19" description="LCD pin 19 enable" begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="LCDS19_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS19_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS20" description="LCD pin 20 enable" begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="LCDS20_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS20_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS21" description="LCD pin 21 enable" begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="LCDS21_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS21_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS22" description="LCD pin 22 enable" begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="LCDS22_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS22_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS23" description="LCD pin 23 enable" begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="LCDS23_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS23_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS24" description="LCD pin 24 enable" begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="LCDS24_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS24_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS25" description="LCD pin 25 enable" begin="25" end="25" width="1" rwaccess="R/W">
            <bitenum id="LCDS25_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS25_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS26" description="LCD pin 26 enable" begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="LCDS26_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS26_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS27" description="LCD pin 27 enable" begin="27" end="27" width="1" rwaccess="R/W">
            <bitenum id="LCDS27_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS27_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS28" description="LCD pin 28 enable" begin="28" end="28" width="1" rwaccess="R/W">
            <bitenum id="LCDS28_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS28_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS29" description="LCD pin 29 enable" begin="29" end="29" width="1" rwaccess="R/W">
            <bitenum id="LCDS29_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS29_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS30" description="LCD pin 30 enable" begin="30" end="30" width="1" rwaccess="R/W">
            <bitenum id="LCDS30_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS30_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS31" description="LCD pin 31 enable" begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="LCDS31_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS31_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
    </register>
