IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/MSP432/LCD_F_356.0.xml
    <register id="LCDPCTL1" width="32" offset="0x10" internal="0" description="LCD_F port control 1">
        <bitfield id="LCDS32" description="LCD pin 32 enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="LCDS32_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS32_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS33" description="LCD pin 33 enable" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="LCDS33_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS33_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS34" description="LCD pin 34 enable" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="LCDS34_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS34_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS35" description="LCD pin 35 enable" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="LCDS35_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS35_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS36" description="LCD pin 36 enable" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="LCDS36_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS36_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS37" description="LCD pin 37 enable" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="LCDS37_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS37_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS38" description="LCD pin 38 enable" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="LCDS38_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS38_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS39" description="LCD pin 39 enable" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="LCDS39_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS39_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS40" description="LCD pin 40 enable" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="LCDS40_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS40_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS41" description="LCD pin 41 enable" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="LCDS41_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS41_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS42" description="LCD pin 42 enable" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="LCDS42_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS42_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS43" description="LCD pin 43 enable" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="LCDS43_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS43_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS44" description="LCD pin 44 enable" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="LCDS44_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS44_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS45" description="LCD pin 45 enable" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="LCDS45_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS45_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS46" description="LCD pin 46 enable" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="LCDS46_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS46_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS47" description="LCD pin 47 enable" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="LCDS47_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS47_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS48" description="LCD pin 48 enable" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="LCDS48_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS48_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS49" description="LCD pin 49 enable" begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="LCDS49_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS49_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS50" description="LCD pin 50 enable" begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="LCDS50_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS50_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS51" description="LCD pin 51 enable" begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="LCDS51_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS51_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS52" description="LCD pin 52 enable" begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="LCDS52_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS52_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS53" description="LCD pin 53 enable" begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="LCDS53_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS53_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS54" description="LCD pin 54 enable" begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="LCDS54_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS54_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS55" description="LCD pin 55 enable" begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="LCDS55_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS55_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS56" description="LCD pin 56 enable" begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="LCDS56_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS56_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS57" description="LCD pin 57 enable" begin="25" end="25" width="1" rwaccess="R/W">
            <bitenum id="LCDS57_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS57_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS58" description="LCD pin 58 enable" begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="LCDS58_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS58_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS59" description="LCD pin 59 enable" begin="27" end="27" width="1" rwaccess="R/W">
            <bitenum id="LCDS59_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS59_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS60" description="LCD pin 60 enable" begin="28" end="28" width="1" rwaccess="R/W">
            <bitenum id="LCDS60_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS60_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS61" description="LCD pin 61 enable" begin="29" end="29" width="1" rwaccess="R/W">
            <bitenum id="LCDS61_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS61_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS62" description="LCD pin 62 enable" begin="30" end="30" width="1" rwaccess="R/W">
            <bitenum id="LCDS62_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS62_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS63" description="LCD pin 63 enable" begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="LCDS63_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS63_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
    </register>
    <register id="LCDCSSEL0" width="32" offset="0x14" internal="0" description="LCD_F COM/SEG select register 0">
        <bitfield id="LCDCSS0" description="L0 Com Seg select" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS0_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS0_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS1" description="L1 Com Seg select" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS1_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS1_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS2" description="L2 Com Seg select" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS2_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS2_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS3" description="L3 Com Seg select" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS3_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS3_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS4" description="L4 Com Seg select" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS4_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS4_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS5" description="L5 Com Seg select" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS5_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS5_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS6" description="L6 Com Seg select" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS6_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS6_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS7" description="L7 Com Seg select" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS7_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS7_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS8" description="L8 Com Seg select" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS8_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS8_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS9" description="L9 Com Seg select" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS9_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS9_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS10" description="L10 Com Seg select" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS10_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS10_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS11" description="L11 Com Seg select" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS11_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS11_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS12" description="L12 Com Seg select" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS12_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS12_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS13" description="L13 Com Seg select" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS13_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS13_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS14" description="L14 Com Seg select" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS14_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS14_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS15" description="L15 Com Seg select" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS15_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS15_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS16" description="L16 Com Seg select" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS16_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS16_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS17" description="L17 Com Seg select" begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS17_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS17_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS18" description="L18 Com Seg select" begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS18_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS18_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS19" description="L19 Com Seg select" begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS19_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS19_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS20" description="L20 Com Seg select" begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS20_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS20_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS21" description="L21 Com Seg select" begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS21_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS21_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS22" description="L22 Com Seg select" begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS22_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS22_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS23" description="L23 Com Seg select" begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS23_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS23_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS24" description="L24 Com Seg select" begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS24_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS24_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS25" description="L25 Com Seg select" begin="25" end="25" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS25_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS25_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS26" description="L26 Com Seg select" begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS26_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS26_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS27" description="L27 Com Seg select" begin="27" end="27" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS27_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS27_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS28" description="L28 Com Seg select" begin="28" end="28" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS28_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS28_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS29" description="L29 Com Seg select" begin="29" end="29" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS29_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS29_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS30" description="L30 Com Seg select" begin="30" end="30" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS30_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS30_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS31" description="L31 Com Seg select" begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS31_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS31_1" value="0x1" description="Common line"/>
        </bitfield>
    </register>
