IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/MSP432/LCD_F_356.0.xml
    <register id="LCDCSSEL1" width="32" offset="0x18" internal="0" description="LCD_F COM/SEG select register 1">
        <bitfield id="LCDCSS32" description="L32 Com Seg select" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS32_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS32_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS33" description="L33 Com Seg select" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS33_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS33_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS34" description="L34 Com Seg select" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS34_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS34_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS35" description="L35 Com Seg select" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS35_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS35_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS36" description="L36 Com Seg select" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS36_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS36_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS37" description="L37 Com Seg select" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS37_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS37_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS38" description="L38 Com Seg select" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS38_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS38_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS39" description="L39 Com Seg select" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS39_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS39_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS40" description="L40 Com Seg select" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS40_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS40_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS41" description="L41 Com Seg select" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS41_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS41_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS42" description="L42 Com Seg select" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS42_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS42_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS43" description="L43 Com Seg select" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS43_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS43_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS44" description="L44 Com Seg select" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS44_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS44_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS45" description="L45 Com Seg select" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS45_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS45_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS46" description="L46 Com Seg select" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS46_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS46_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS47" description="L47 Com Seg select" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS47_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS47_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS48" description="L48 Com Seg select" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS48_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS48_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS49" description="L49 Com Seg select" begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS49_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS49_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS50" description="L50 Com Seg select" begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS50_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS50_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS51" description="L51 Com Seg select" begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS51_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS51_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS52" description="L52 Com Seg select" begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS52_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS52_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS53" description="L53 Com Seg select" begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS53_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS53_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS54" description="L54 Com Seg select" begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS54_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS54_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS55" description="L55 Com Seg select" begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS55_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS55_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS56" description="L56 Com Seg select" begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS56_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS56_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS57" description="L57 Com Seg select" begin="25" end="25" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS57_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS57_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS58" description="L58 Com Seg select" begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS58_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS58_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS59" description="L59 Com Seg select" begin="27" end="27" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS59_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS59_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS60" description="L60 Com Seg select" begin="28" end="28" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS60_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS60_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS61" description="L61 Com Seg select" begin="29" end="29" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS61_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS61_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS62" description="L62 Com Seg select" begin="30" end="30" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS62_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS62_1" value="0x1" description="Common line"/>
        </bitfield>
        <bitfield id="LCDCSS63" description="L63 Com Seg select" begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="LCDCSS63_0" value="0x0" description="Segment line"/>
            <bitenum id="LCDCSS63_1" value="0x1" description="Common line"/>
        </bitfield>
    </register>
    <register id="LCDANMCTL" width="32" offset="0x1C" internal="0" description="LCD_F Animation Control Register">
        <bitfield id="LCDANMEN" description="Enable Animation" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="LCDANMEN_0" value="0x0" description="Animation disabled"/>
            <bitenum id="LCDANMEN_1" value="0x1" description="Animation enabled"/>
        </bitfield>
        <bitfield id="LCDANMSTP" description="Number of Amimation frames" begin="3" end="1" width="3" rwaccess="R/W">
            <bitenum id="LCDANMSTP_0" value="0x0" description="T0"/>
            <bitenum id="LCDANMSTP_1" value="0x1" description="T0 to T1"/>
            <bitenum id="LCDANMSTP_2" value="0x2" description="T0 to T2"/>
            <bitenum id="LCDANMSTP_3" value="0x3" description="T0 to T3"/>
            <bitenum id="LCDANMSTP_4" value="0x4" description="T0 to T4"/>
            <bitenum id="LCDANMSTP_5" value="0x5" description="T0 to T5"/>
            <bitenum id="LCDANMSTP_6" value="0x6" description="T0 to T6"/>
            <bitenum id="LCDANMSTP_7" value="0x7" description="T0 to T7"/>
        </bitfield>
        <bitfield id="LCDANMCLR" description="Clear Animation Memory" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="LCDANMCLR_0" value="0x0" description="Contents of animation memory registers LCDANMx remain unchanged"/>
            <bitenum id="LCDANMCLR_1" value="0x1" description="Clear content of all animation memory registers LCDANMx"/>
        </bitfield>
        <bitfield id="LCDANMPRE" description="Clock pre-scaler for animation frequency" begin="18" end="16" width="3" rwaccess="R/W">
            <bitenum id="LCDANMPRE_0" value="0x0" description="Divide by 512"/>
            <bitenum id="LCDANMPRE_1" value="0x1" description="Divide by 1024"/>
            <bitenum id="LCDANMPRE_2" value="0x2" description="Divide by 2048"/>
            <bitenum id="LCDANMPRE_3" value="0x3" description="Divide by 4096"/>
            <bitenum id="LCDANMPRE_4" value="0x4" description="Divide by 8162"/>
            <bitenum id="LCDANMPRE_5" value="0x5" description="Divide by 16384"/>
            <bitenum id="LCDANMPRE_6" value="0x6" description="Divide by 32768"/>
            <bitenum id="LCDANMPRE_7" value="0x7" description="Divide by 65536"/>
        </bitfield>
        <bitfield id="LCDANMDIV" description="Clock divider for animation frequency" begin="21" end="19" width="3" rwaccess="R/W">
            <bitenum id="LCDANMDIV_0" value="0x0" description="Divide by 1"/>
            <bitenum id="LCDANMDIV_1" value="0x1" description="Divide by 2"/>
            <bitenum id="LCDANMDIV_2" value="0x2" description="Divide by 3"/>
            <bitenum id="LCDANMDIV_3" value="0x3" description="Divide by 4"/>
            <bitenum id="LCDANMDIV_4" value="0x4" description="Divide by 5"/>
            <bitenum id="LCDANMDIV_5" value="0x5" description="Divide by 6"/>
            <bitenum id="LCDANMDIV_6" value="0x6" description="Divide by 7"/>
            <bitenum id="LCDANMDIV_7" value="0x7" description="Divide by 8"/>
        </bitfield>
    </register>
    <register id="LCDIE" width="32" offset="0x110" internal="0" description="LCD_F interrupt enable register">
        <bitfield id="LCDBLKOFFIE" description="LCD Blink, segments off interrupt enable" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="LCDBLKOFFIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="LCDBLKOFFIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="LCDBLKONIE" description="LCD Blink, segments on interrupt enable" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="LCDBLKONIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="LCDBLKONIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="LCDFRMIE" description="LCD Frame interrupt enable" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="LCDFRMIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="LCDFRMIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="LCDANMSTPIE" description="LCD Animation step interrupt enable" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="LCDANMSTPIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="LCDANMSTPIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="LCDANMLOOPIE" description="LCD Animation loop interrupt enable" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="LCDANMLOOPIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="LCDANMLOOPIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
    </register>
    <register id="LCDIFG" width="32" offset="0x114" internal="0" description="LCD_F interrupt flag register">
        <bitfield id="LCDBLKOFFIFG" description="LCD Blink, segments off interrupt flag" begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="LCDBLKOFFIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="LCDBLKOFFIFG_1" value="0x1" description="Interrupt due to LCD Blink, segments on"/>
        </bitfield>
        <bitfield id="LCDBLKONIFG" description="LCD Blink, segments on interrupt flag" begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="LCDBLKONIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="LCDBLKONIFG_1" value="0x1" description="Interrupt due to LCD Blink, segments on"/>
        </bitfield>
        <bitfield id="LCDFRMIFG" description="LCD Frame interrupt flag" begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="LCDFRMIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="LCDFRMIFG_1" value="0x1" description="Interrupt due to LCD frame"/>
        </bitfield>
        <bitfield id="LCDANMSTPIFG" description="LCD Animation step interrupt flag" begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="LCDANMSTPIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="LCDANMSTPIFG_1" value="0x1" description="Interrupt due to LCD Animation step on"/>
        </bitfield>
        <bitfield id="LCDANMLOOPIFG" description="LCD Animation loop interrupt flag" begin="9" end="9" width="1" rwaccess="R">
            <bitenum id="LCDANMLOOPIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="LCDANMLOOPIFG_1" value="0x1" description="Interrupt due to LCD Animation loop on"/>
        </bitfield>
    </register>
    <register id="LCDSETIFG" width="32" offset="0x118" internal="0" description="LCD_F set interrupt flag register">
        <bitfield id="SETLCDBLKOFFIFG" description="Sets LCDBLKOFFIFG" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="SETLCDBLKOFFIFG_0" value="0x0" description="No effect"/>
            <bitenum id="SETLCDBLKOFFIFG_1" value="0x1" description="Sets interrupt flag"/>
        </bitfield>
        <bitfield id="SETLCDBLKONIFG" description="Sets LCDBLKONIFG" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="SETLCDBLKONIFG_0" value="0x0" description="No effect"/>
            <bitenum id="SETLCDBLKONIFG_1" value="0x1" description="Sets interrupt flag"/>
        </bitfield>
        <bitfield id="SETLCDFRMIFG" description="Sets LCDFRMIFG" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="SETLCDFRMIFG_0" value="0x0" description="No effect"/>
            <bitenum id="SETLCDFRMIFG_1" value="0x1" description="Sets interrupt flag"/>
        </bitfield>
        <bitfield id="SETLCDANMSTPIFG" description="Sets LCDANMSTPIFG" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="SETLCDANMSTPIFG_0" value="0x0" description="No effect"/>
            <bitenum id="SETLCDANMSTPIFG_1" value="0x1" description="Sets interrupt flag"/>
        </bitfield>
        <bitfield id="SETLCDANMLOOPIFG" description="Sets LCDANMLOOPIFG" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="SETLCDANMLOOPIFG_0" value="0x0" description="No effect"/>
            <bitenum id="SETLCDANMLOOPIFG_1" value="0x1" description="Sets interrupt flag"/>
        </bitfield>
    </register>
