IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/MSP432/LCD_F_356.0.xml
    <register id="LCDCLRIFG" width="32" offset="0x11C" internal="0" description="LCD_F clear interrupt flag register">
        <bitfield id="CLRLCDBLKOFFIFG" description="Clears LCDBLKOFFIFG" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="CLRLCDBLKOFFIFG_0" value="0x0" description="No effect"/>
            <bitenum id="CLRLCDBLKOFFIFG_1" value="0x1" description="Clears pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRLCDBLKONIFG" description="Clears LCDBLKONIFG" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="CLRLCDBLKONIFG_0" value="0x0" description="No effect"/>
            <bitenum id="CLRLCDBLKONIFG_1" value="0x1" description="Clears pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRLCDFRMIFG" description="Clears LCDFRMIFG" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="CLRLCDFRMIFG_0" value="0x0" description="No effect"/>
            <bitenum id="CLRLCDFRMIFG_1" value="0x1" description="Clears pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRLCDANMSTPIFG" description="Clears LCDANMSTPIFG" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="CLRLCDANMSTPIFG_0" value="0x0" description="No effect"/>
            <bitenum id="CLRLCDANMSTPIFG_1" value="0x1" description="Clears pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRLCDANMLOOPIFG" description="Clears LCDANMLOOPIFG" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="CLRLCDANMLOOPIFG_0" value="0x0" description="No effect"/>
            <bitenum id="CLRLCDANMLOOPIFG_1" value="0x1" description="Clears pending interrupt flag"/>
        </bitfield>
    </register>
    <register id="LCDM" width="8" offset="0x120" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x121" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x122" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x123" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x124" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x125" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x126" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x127" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x128" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x129" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x12A" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x12B" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x12C" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x12D" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x12E" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x12F" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x130" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x131" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x132" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x133" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x134" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x135" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x136" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x137" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x138" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x139" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x13A" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x13B" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x13C" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x13D" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x13E" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x13F" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x140" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x141" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x142" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x143" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x144" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x145" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x146" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x147" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x148" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x149" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x14A" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x14B" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x14C" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x14D" internal="0" description="LCD memory registers">
    </register>
