IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/MSP432/LCD_F_356.0.xml
    <register id="LCDM" width="8" offset="0x14E" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDM" width="8" offset="0x14F" internal="0" description="LCD memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x160" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x161" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x162" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x163" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x164" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x165" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x166" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x167" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x168" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x169" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x16A" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x16B" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x16C" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x16D" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x16E" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x16F" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x170" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x171" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x172" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x173" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x174" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x175" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x176" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x177" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x178" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x179" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x17A" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x17B" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x17C" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x17D" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x17E" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x17F" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x180" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x181" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x182" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x183" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x184" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x185" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x186" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x187" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x188" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x189" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x18A" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x18B" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x18C" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x18D" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x18E" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDBM" width="8" offset="0x18F" internal="0" description="LCD Blinking memory registers">
    </register>
    <register id="LCDANM" width="8" offset="0x1A0" internal="0" description="LCD Animation memory registers">
    </register>
    <register id="LCDANM" width="8" offset="0x1A1" internal="0" description="LCD Animation memory registers">
    </register>
    <register id="LCDANM" width="8" offset="0x1A2" internal="0" description="LCD Animation memory registers">
    </register>
    <register id="LCDANM" width="8" offset="0x1A3" internal="0" description="LCD Animation memory registers">
    </register>
    <register id="LCDANM" width="8" offset="0x1A4" internal="0" description="LCD Animation memory registers">
    </register>
    <register id="LCDANM" width="8" offset="0x1A5" internal="0" description="LCD Animation memory registers">
    </register>
    <register id="LCDANM" width="8" offset="0x1A6" internal="0" description="LCD Animation memory registers">
    </register>
    <register id="LCDANM" width="8" offset="0x1A7" internal="0" description="LCD Animation memory registers">
    </register>
</module>
